{"class_name": "Model", "keras_version": "2.1.6", "config": {"output_layers": [["activation_20", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 128, 128, 1], "name": "input_1", "sparse": false, "dtype": "float32"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_1", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.30000001192092896}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_2", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_1", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_3", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_2", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_4", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_3", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_5", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_4", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_6", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_5", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_7", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_6", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_8", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_7", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_9", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_8", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "padding": "valid", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_10", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_9", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_11", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_10", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_12", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [1, 1], "padding": "same"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_11", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "activation_11", "class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_14", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [1, 1], "padding": "same"}, "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_transpose_1", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_13", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [2, 2], "padding": "same"}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {}], ["conv2d_13", 0, 0, {}]]]}, {"name": "activation_12", "class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_15", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [1, 1], "padding": "same"}, "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"name": "activation_13", "class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_1", "trainable": true, "data_format": "channels_last", "size": [2, 2]}, "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "output_shape_type": "raw", "arguments": {"repnum": 64}, "output_shape": null, "function_type": "lambda", "function": ["4wIAAAAAAAAAAgAAAAUAAABTAAAAcxYAAAB0AABqAQB8AAB8AQBkAQBkAgCDAgFTKQNO2gRheGlz\n6QMAAAApAtoBS9oPcmVwZWF0X2VsZW1lbnRzKQLaAXjaBnJlcG51bakAcgcAAAD6QkQ6XEdpdGh1\nYlJlc3BvXEFpck1vbml0b3JcT0RDLWRldGVjdFxwZXJjZXB0aW9uXG1vZGVsc1xBdHRuVW5ldC5w\nedoIPGxhbWJkYT4oAAAAcwAAAAA=\n", null, null]}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"name": "multiply_1", "class_name": "Multiply", "config": {"name": "multiply_1", "trainable": true}, "inbound_nodes": [[["lambda_1", 0, 0, {}], ["activation_8", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_16", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [1, 1], "padding": "same"}, "inbound_nodes": [[["multiply_1", 0, 0, {}]]]}, {"name": "conv2d_transpose_2", "class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_transpose_2", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_12", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": 3}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]]}, {"name": "conv2d_17", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_17", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [1, 1], "padding": "same"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_13", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_17", 0, 0, {}]]]}, {"name": "activation_14", "class_name": "Activation", "config": {"name": "activation_14", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"name": "conv2d_19", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_19", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [1, 1], "padding": "same"}, "inbound_nodes": [[["activation_14", 0, 0, {}]]]}, {"name": "conv2d_transpose_3", "class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_transpose_3", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["conv2d_19", 0, 0, {}]]]}, {"name": "conv2d_18", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_18", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [2, 2], "padding": "same"}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {}], ["conv2d_18", 0, 0, {}]]]}, {"name": "activation_15", "class_name": "Activation", "config": {"name": "activation_15", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "conv2d_20", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_20", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [1, 1], "padding": "same"}, "inbound_nodes": [[["activation_15", 0, 0, {}]]]}, {"name": "activation_16", "class_name": "Activation", "config": {"name": "activation_16", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_20", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_2", "trainable": true, "data_format": "channels_last", "size": [2, 2]}, "inbound_nodes": [[["activation_16", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "output_shape_type": "raw", "arguments": {"repnum": 64}, "output_shape": null, "function_type": "lambda", "function": ["4wIAAAAAAAAAAgAAAAUAAABTAAAAcxYAAAB0AABqAQB8AAB8AQBkAQBkAgCDAgFTKQNO2gRheGlz\n6QMAAAApAtoBS9oPcmVwZWF0X2VsZW1lbnRzKQLaAXjaBnJlcG51bakAcgcAAAD6QkQ6XEdpdGh1\nYlJlc3BvXEFpck1vbml0b3JcT0RDLWRldGVjdFxwZXJjZXB0aW9uXG1vZGVsc1xBdHRuVW5ldC5w\nedoIPGxhbWJkYT4oAAAAcwAAAAA=\n", null, null]}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"name": "multiply_2", "class_name": "Multiply", "config": {"name": "multiply_2", "trainable": true}, "inbound_nodes": [[["lambda_2", 0, 0, {}], ["activation_6", 0, 0, {}]]]}, {"name": "conv2d_21", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_21", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [1, 1], "padding": "same"}, "inbound_nodes": [[["multiply_2", 0, 0, {}]]]}, {"name": "conv2d_transpose_4", "class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_transpose_4", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_14", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_21", 0, 0, {}]]]}, {"name": "concatenate_2", "class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "axis": 3}, "inbound_nodes": [[["conv2d_transpose_4", 0, 0, {}], ["batch_normalization_14", 0, 0, {}]]]}, {"name": "conv2d_22", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_22", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [1, 1], "padding": "same"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_15", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_22", 0, 0, {}]]]}, {"name": "activation_17", "class_name": "Activation", "config": {"name": "activation_17", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "conv2d_24", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_24", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [1, 1], "padding": "same"}, "inbound_nodes": [[["activation_17", 0, 0, {}]]]}, {"name": "conv2d_transpose_5", "class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_transpose_5", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "data_format": "channels_last", "activation": "linear", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["conv2d_24", 0, 0, {}]]]}, {"name": "conv2d_23", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_23", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [2, 2], "padding": "same"}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["conv2d_transpose_5", 0, 0, {}], ["conv2d_23", 0, 0, {}]]]}, {"name": "activation_18", "class_name": "Activation", "config": {"name": "activation_18", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "conv2d_25", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_25", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 1, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [1, 1], "padding": "same"}, "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"name": "activation_19", "class_name": "Activation", "config": {"name": "activation_19", "trainable": true, "activation": "sigmoid"}, "inbound_nodes": [[["conv2d_25", 0, 0, {}]]]}, {"name": "up_sampling2d_3", "class_name": "UpSampling2D", "config": {"name": "up_sampling2d_3", "trainable": true, "data_format": "channels_last", "size": [2, 2]}, "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "output_shape_type": "raw", "arguments": {"repnum": 32}, "output_shape": null, "function_type": "lambda", "function": ["4wIAAAAAAAAAAgAAAAUAAABTAAAAcxYAAAB0AABqAQB8AAB8AQBkAQBkAgCDAgFTKQNO2gRheGlz\n6QMAAAApAtoBS9oPcmVwZWF0X2VsZW1lbnRzKQLaAXjaBnJlcG51bakAcgcAAAD6QkQ6XEdpdGh1\nYlJlc3BvXEFpck1vbml0b3JcT0RDLWRldGVjdFxwZXJjZXB0aW9uXG1vZGVsc1xBdHRuVW5ldC5w\nedoIPGxhbWJkYT4oAAAAcwAAAAA=\n", null, null]}, "inbound_nodes": [[["up_sampling2d_3", 0, 0, {}]]]}, {"name": "multiply_3", "class_name": "Multiply", "config": {"name": "multiply_3", "trainable": true}, "inbound_nodes": [[["lambda_3", 0, 0, {}], ["activation_4", 0, 0, {}]]]}, {"name": "conv2d_26", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_26", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "linear", "kernel_size": [1, 1], "padding": "same"}, "inbound_nodes": [[["multiply_3", 0, 0, {}]]]}, {"name": "conv2d_transpose_6", "class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_transpose_6", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "batch_normalization_16", "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "name": "batch_normalization_16", "trainable": true, "center": true, "scale": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_constraint": null, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null}, "inbound_nodes": [[["conv2d_26", 0, 0, {}]]]}, {"name": "concatenate_3", "class_name": "Concatenate", "config": {"name": "concatenate_3", "trainable": true, "axis": 3}, "inbound_nodes": [[["conv2d_transpose_6", 0, 0, {}], ["batch_normalization_16", 0, 0, {}]]]}, {"name": "conv2d_transpose_7", "class_name": "Conv2DTranspose", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_transpose_7", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "data_format": "channels_last", "activation": "relu", "kernel_size": [3, 3], "padding": "same"}, "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "concatenate_4", "class_name": "Concatenate", "config": {"name": "concatenate_4", "trainable": true, "axis": 3}, "inbound_nodes": [[["conv2d_transpose_7", 0, 0, {}], ["activation_2", 0, 0, {}]]]}, {"name": "conv2d_27", "class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "name": "conv2d_27", "trainable": true, "bias_constraint": null, "activity_regularizer": null, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "use_bias": true, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 2, "dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_size": [1, 1], "padding": "same"}, "inbound_nodes": [[["concatenate_4", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"target_shape": [16384, 2], "name": "reshape_1", "trainable": true}, "inbound_nodes": [[["conv2d_27", 0, 0, {}]]]}, {"name": "activation_20", "class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["reshape_1", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}